src/cf/InformationRegisters/БанковскиеДокументыАУСН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>БанковскиеДокументыАУСН</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтправитьВБанк</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусОбменаАУСН</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОбменаАУСН</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДанныеВФорматеСервиса</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПолучателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбмена</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОшибкаНаСторонеБанка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветФНС</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СписаниеСРасчетногоСчета</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНаРасчетныйСчет</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьБанк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ПредупрежденияПриЗагрузкеВыписки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ПредупрежденияПриЗагрузкеВыписки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтрокаВыписки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстСообщенияПользователю</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СписаниеСРасчетногоСчета</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНаРасчетныйСчет</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/СостоянияИнтеграцииАУСН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>СостоянияИнтеграцииАУСН</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияИнтеграцииАУСН</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторПриложения</Name>
					<Comment>Идентификатор приложения в сервисе АУСН</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КодЗаявки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ошибки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагруженоБанковскихДокументов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбмена</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БлокирующаяОшибкаОбмена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОшибкиОтправки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторБанков</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/CommonModules/ИнтеграцияАУСНВызовСервера/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Запускает фоновое задание по обмену с сервисом АУСН
//
// Параметры:
// Идентификатор - УникальныйИдентификатор - ключ формы, которая инициировала выполнение фонового задания
//
Функция ВыполнитьОбменССервисомВФонеНаСервере(Идентификатор) Экспорт
	
	НастройкиЗапуска = ДлительныеОперации.ПараметрыВыполненияФункции(Идентификатор);
	НастройкиЗапуска.НаименованиеФоновогоЗадания = НСтр("ru = 'Обмен с сервисом АУСН'");
		
	НастройкиЗапуска.ОжидатьЗавершение = 0;
	НастройкиЗапуска.ЗапуститьВФоне = Истина;
	Адрес = ПоместитьВоВременноеХранилище(Неопределено, Идентификатор);
	
	Результат = ДлительныеОперации.ВыполнитьФункцию(
		НастройкиЗапуска,
		"ИнтеграцияАУСН.ВыполнитьОбменССервисом",
		Адрес);
	
	Возврат Результат;
	
КонецФункции

// Возвращает текст ошибки для документа с ошибкой заполнения
//
// Параметры:
//  ПараметрыДокумента - Структура -
//                       см. ЗагрузкаВыпискиПоБанковскомуСчету.НовыйПараметрыДокументаДляРаспознаванияОперации
//
// Возвращаемое значение:
//  Строка
//
Функция ТекстСообщенияОбОшибке(ПараметрыДокумента) Экспорт
	
	ЧастиСообщения = Новый Массив;
	Если РегистрыСведений.БанковскиеДокументыАУСН.ОперацияОтклоненаФНС(ПараметрыДокумента.Ссылка) Тогда
		ОтветФНС = РегистрыСведений.БанковскиеДокументыАУСН.ОтветФНС(ПараметрыДокумента.Ссылка);
	Иначе
		ОтветФНС = "";
		ЧастиСообщения.Добавить(НСтр(
			"ru = 'Ошибка заполнения документа, загруженного из сервиса АУСН'",
			ОбщегоНазначения.КодОсновногоЯзыка()));
	КонецЕсли;
	
	ТекстСообщения = РегистрыСведений.ПредупрежденияПриЗагрузкеВыписки.ПредупреждениеДляДокумента(
		ПараметрыДокумента);
	ЧастиСообщения.Добавить(ТекстСообщения);
	
	Если ЗначениеЗаполнено(ОтветФНС) Тогда
		ЧастиСообщения.Добавить(ОтветФНС);
		Попытка
			ОбъектОтветФНС = ИнтеграцияАУСН.РасшифроватьОтветФНС(ОтветФНС);
			ДокументыСОшибками = Новый Массив;
			Для Каждого СтатусОперации Из ОбъектОтветФНС.OperationStatuses Цикл
				Если ВРег(СтатусОперации.StatusCode) <> ИнтеграцияАУСНКлиентСервер.ИмяСтатусаПринятФНС() Тогда
					ДокументыСОшибками.Добавить(СтатусОперации.Id);
				КонецЕсли;
			КонецЦикла;
			ЧастиСообщения.Добавить(РегистрыСведений.БанковскиеДокументыАУСН.ДанныеВФорматеСервисаПоИдентификаторам(
				ДокументыСОшибками));
		Исключение
			Информация = ИнформацияОбОшибке();
			ИнтеграцияАУСН.ЗаписатьОшибкуВЖурналРегистрации(
				КраткоеПредставлениеОшибки(Информация), ПодробноеПредставлениеОшибки(Информация));
		КонецПопытки;
	Иначе
		ЧастиСообщения.Добавить(РегистрыСведений.БанковскиеДокументыАУСН.ДанныеВФорматеСервиса(ПараметрыДокумента.Ссылка));
	КонецЕсли;
	
	Возврат СтрСоединить(ЧастиСообщения, Символы.ПС);
	
КонецФункции

Функция СсылкаЛКБанкаИзСостоянияОбмена(АдресДанных) Экспорт
	
	ДанныеСостоянияОбмена = ПолучитьИзВременногоХранилища(АдресДанных);
	
	Если ЭтоАдресВременногоХранилища(ДанныеСостоянияОбмена.ОшибкиАУСН) Тогда
		ОшибкиОбмена = ПолучитьИзВременногоХранилища(ДанныеСостоянияОбмена.ОшибкиАУСН);
	Иначе
		ОшибкиОбмена = Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(ОшибкиОбмена) = Тип("ТаблицаЗначений") И ЗначениеЗаполнено(ОшибкиОбмена) Тогда
		СтрокаОшибка = ОшибкиОбмена[0];
		ПодключенныеБанки = РегистрыСведений.СостоянияИнтеграцииАУСН.Банки(
			СтрокаОшибка.Организация, СтрокаОшибка.ИдентификаторБанка);
		Если ПодключенныеБанки.Следующий() Тогда
			Возврат ИнтеграцияАУСНПовтИсп.СсылкаЛичныйКабинетБанка(ПодключенныеБанки.Банк);
		КонецЕсли;
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Функция СсылкаЛКБанкаПоБанковскомуСчету(Счет) Экспорт
	
	БИК = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Счет, "Банк.Код");
	БанкПоКлассификатору = РаботаСБанкамиБП.СсылкаПоКлассификатору(БИК);
	Возврат ИнтеграцияАУСНПовтИсп.СсылкаЛичныйКабинетБанка(БанкПоКлассификатору);
	
КонецФункции

// Проверяет соответствие вида документа физического лица требованиям ФНС для обмена с сервисом АУСН
//
// Параметры:
//  ВидДокумента - СправочникСсылка.ВидыДокументовФизическихЛиц
//  ТекстОшибки - Строка - в этот параметр передается текст ошибки, если переданное значение не прошло проверку
//
// Возвращаемое значение:
//  Булево - признак того, что переданное значение соответствует требованиям, указанным в протоколе обмена
//
Функция ВидДокументаСоответствуетПротоколуОбмена(ВидДокумента, ТекстОшибки) Экспорт
	
	КодЯзыка = ОбщегоНазначения.КодОсновногоЯзыка();
	КодВидаДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидДокумента, "КодМВД");
	
	РезультатПроверки = Истина;
	
	Если ЗначениеЗаполнено(ВидДокумента) И Не ЗначениеЗаполнено(КодВидаДокумента) Тогда
		ТекстОшибки = НСтр("ru = 'Недопустимый вид документа'", КодЯзыка);
		РезультатПроверки = Ложь;
	ИначеЕсли Не ЗначениеЗаполнено(ВидДокумента) Тогда
		ТекстОшибки = НСтр("ru = 'Не заполнен вид документа'", КодЯзыка);
		РезультатПроверки = Ложь;
	Иначе
		ДопустимыеВидыДокументов = ИнтеграцияАУСНКлиентСервер.ДопустимыеВидыДокументовФизическихЛиц();
		Если ДопустимыеВидыДокументов.Найти(КодВидаДокумента) = Неопределено Тогда
			ТекстОшибки = НСтр("ru = 'Недопустимый вид документа'", КодЯзыка);
			РезультатПроверки = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Возврат РезультатПроверки;
	
КонецФункции

#КонецОбласти
